{
    "url": "https://www.gpw.pl/komunikat?geru_id=440609&title=Invitation+and+materials+for+a+General+shareholders+meeting",
    "content": "RB-W: Invitation and materials for a General shareholders meetingData:2024-05-10Firma:EUROHOLD BULGARIA ADSpis tresci:1.RAPORT BIEŻĄCY2.MESSAGE (ENGLISH VERSION)3.INFORMACJE O PODMIOCIE4.PODPISY OSÓB REPREZENTUJĄCYCH SPÓŁKĘSpis zalacznikow:ENG_ Notice 30.05.2024 additional.pdfArkusz: RAPORT BIEŻĄCYZnaleziono 1 załącznikNazwa arkusza:RAPORT BIEŻĄCYKOMISJA NADZORU FINANSOWEGORaport bieżący nr14/2024Data sporządzenia:2024-05-10Skrócona nazwa emitentaEUROHOLD BULGARIA ADTematInvitation and materials for a General shareholders meetingPodstawa prawnaInne uregulowaniaTreść raportu:Invitation and materials for a General shareholders meetingZałącznikiPlikOpisENG_ Notice 30.05.2024 additional.pdfInvitation and materials for a General shareholders meetingNazwa arkusza:MESSAGE (ENGLISH VERSION)MESSAGE _ENGLISH VERSION_Nazwa arkusza:INFORMACJE O PODMIOCIEEUROHOLD BULGARIA AD_pełna nazwa emitenta_EUROHOLD BULGARIA ADFinanse inne _fin__skrócona nazwa emitenta__sektor wg. klasyfikacji GPW w W-wie_1592Sofia_kod pocztowy__miejscowość_Christopher Columbus Blvd.43_ulica__numer_+359 29 651 651+359 29 651 652_telefon__fax_investors@eurohold.bgwww.eurohold.bg_e-mail__www_BG 175187337SEE_NIP__REGON_Nazwa arkusza:PODPISY OSÓB REPREZENTUJĄCYCH SPÓŁKĘPODPISY OSÓB REPREZENTUJĄCYCH SPÓŁKĘDataImię i NazwiskoStanowisko/FunkcjaPodpis2024-05-10Galya GeorgievaIR MANAGERGALYA GEORGIEVAIdentyfikator raportuds6x0hpt41Nazwa raportuRB-WSymbol raportuRB-WNazwa emitentaEUROHOLD BULGARIA ADSymbol EmitentaEUROHOLD BULGARIA ADTytulInvitation and materials for a General shareholders meetingSektorFinanse inne (fin)Kod1592MiastoSofiaUlicaChristopher Columbus Blvd.Nr43Tel.+359 29 651 651Fax+359 29 651 652e-mailinvestors@eurohold.bgNIPBG 175187337REGONSEEData sporzadzenia2024-05-10Rok biezacy2024Numer14adres wwwwww.eurohold.bgMATERIALS AND PROPOSALS FOR RESOLUTIONS\nUNDER THE AGENDA OF THE EXTRAORDINARY MEETING OF THE SHAREHOLDERS OF\nEUROHOLD BULGARIA AD\nCONVENED FOR 30.05.2024\nI. DRAFT RESOLUTIONS:\nItem one: Adoption of a resolution for issuance by Eurohold Bulgaria AD of an issue of warrants in the\namount of up to 260 500 000 (two hundred and sixty million and five hundred thousand) dematerialized,\nregistered, freely transferable warrants.\n(Draft resolution No. l:\nPursuant to Art. 112b et seq. of the Public Offering of Securities Act {POSA), the General Meeting of\nShareholders of Eurohold Bulgaria AD adopts a resolution for the issuance by the company of an issue of\nwarrants in the amount of up to 260 500 000 (two hundred and sixty million and five hundred thousand)\ndematerialized, registered, freely transferable warrants under the terms of a public offering pursuant to the\nprovisions of the Public Offering of Securities Act, with an issue value of BGN 0.50 (fifty stotinki) for each warrant,\nwhich entitle the warrant holders to exercise within a 10-year period their right to subscribe for the\ncorresponding number of shares (of the same type and class as the existing issue of shares of the company -\ndematerialized, registered, non-preferred, with the right to 1 (one) vote in the general meeting of the\nshareholders of the company, with the right to dividend and right to liquidation share) - the underlying asset of\nthe warrants under issue value BGN 2.00 (two Bulgarian lev) per share, at a warrant/share conversion ratio of\n1:1, which shares \"Eurohold Bulgaria\" AD will issue in the future conditional capital increase/s, under the\ncondition, that the new shares are issued only for subscription by the owners of the warrants.\nThe public offering of the issue of warrants of Eurohold Bulgaria AD shall be considered successfully\ncompleted only if at least 78 150 000 warrants are subscribed and fully paid, representing 30% (thirty percent) of\nthe offered for issuance securities. It is not possible to subscribe for warrants above the maximum permissible\namount of securities offered for issuance amounting to 260 500 000 warrants.\nTo carry out the public offering of the issue of warrants of Eurohold Bulgaria AD, the company will\npublish a prospectus in the manner and with the content provided for in the POSA and its implementing acts,\nafter such prospectus is confirmed by the Financial Supervision Commission. The planned use of the funds raised\nthrough the issue of warrants and the risks related to the activity of Eurohold Bulgaria AD and to the investment\nin the securities subject to the public offering will be described in detail in the prospectus.\nThe investment intermediary, which will service the warrants issue of Eurohold Bulgaria AD under the\nconditions of public offering, will be Euro-Finance AD, entered in the Commercial Register at the Registry Agency\nwith UIC: 831136740, with registered office and address in Sofia, 43 Christopher Columbus Blvd., 5th floor.\nThe prospectus for public offering of the issue of warrants of Eurohold Bulgaria AD will be available to\npotential investors and the current shareholders of the company through its publication on the issuer's website -\nwww.eurohold.bg and the authorized investment intermediary Euro-Finance AD, Sofia\nhttp://www.eurofinance.bg. Additional information on the prospectus, as well as a free copy of it will be\navailable at the registered address of the issuer Eurohold Bulgaria AD: Sofia 1592, 43 Christopher Columbus\nBlvd., Tel.: {+359 2) 9651 563, Fax: {+359 2) 9651 652, contact person: Ga/ya Georgieva, from 9.30 am to 5.00\npm every working day during the period of the public offering. In accordance with the regulatory requirements,\nthe prospectus will be published and available on the websites of the Financial Supervision Commission,\nwww.fsc.bg and on the Bulgarian Stock Exchange -Sofia AD -www.bse-sofia.bg, at the public registers where all\nthe periodic and other regulated information about the issuer of the securities - Eurohold Bulgaria AD can be\nobtained.\nPursuant to Art. 112b, para. 2 in conj. with Art. 112b, para. 11 of the POSA, the persons who have\nacquired shares no later than 5 (five) working days after the date of publication of the announcement under Art.\n189t, para. 1 of POSA shall be entitled to participate in the procedure of the public offering of warrants. Within\ntwo working days of the expiration of the specified term of 5 working days, the Central Depository AD opens\naccounts for rights of these persons on the basis of data entered in the book of shareholders. Against each share\nfrom the capital of Eurohold Bulgaria AD is issued one right within the meaning of§ 1, item 3 of the Additional\nProvisions of the POSA in conj. with Art. 112b, para. 11 of POSA. Against each 1 (one) right, its holder may\nsubscribe for 1 (one) warrant from the issue of warrants at an issue value of BGN 0.50 (fifty stotinki) for a\nwarrant. All persons who wish to subscribe for warrants from the issue of warrants of Eurohold Bulgaria AD shall\nfirst acquire rights. The current shareholders acquire the rights free of charge under the procedure described\nabove. All other investors may purchase rights through a trade performed at the organized by the Bulgarian\nStock Exchange - Sofia AD \"Rights Market\" within the term for free trading of the rights or through purchase\nunder the conditions of an open auction for the unexercised rights, according to the procedure described in detail\nin prospectus.\nIn accordance with Art. 89/, para. 1 of the POSA, the General Meeting of Shareholders authorizes the\nManagement Board of Eurohold Bulgaria AD to decide on a one-time extension of the term for subscription of\nwarrants by up to 60 (sixty) days, as in which case, the relevant amendments will be made to the prospectus for\npublic offering and the issuer will immediately publish the information on the extension of the term on its\nwebsite, the Financial Supervision Commission and the authorized investment intermediary Euro-Finance AD will\nbe notified. In this case, the last day of the extended subscription period will be considered the subscription\ndeadline.\nAll other regulatory conditions and requirements in connection with the public offering of the issue of\nwarrants of Eurohold Bulgaria AD will be detailed and duly described in the prospectus for public offering of\nsecurities, the adoption of which by the Management Board of the company is forthcoming.\nIn accordance with the resolution for the issuance of the issue of warrants, the General Meeting of\nShareholders authorizes the Management Board of the company at its discretion, within the main parameters\napproved by the General Meeting of Shareholders and in accordance with the applicable law, to specify all other\nlegal and financial parameters of the issue of warrants and to determine all additional terms and conditions,\nlegal and financial parameters of the issue within the limits set by the resolution of the General Meeting and the\nlaw, as well as to perform all other legal and factual acts required by law in connection with the issuance of the\nissue of warrants, including the acts related to the subsequent preparation and approval by the Financial\nSupervision Commission of a prospectus for public offering of the issue of warrants.\nDraft resolution No.2 (supplemented pursuant to Article 223a of the CA in conjunction with Art. 118,\npara. 2, item 4 of the POSA}:\nPursuant to Art. 112b et seq. of the Public Offering of Securities Act {POSA), the General Meeting of\nShareholders of Eurohold Bulgaria AD adopts a resolution for the issuance by the company of an issue of\nwarrants in the amount of up to 260 500 000 (two hundred and sixty million and five hundred thousand)\ndematerialized, registered, freely transferable warrants under the terms of a public offering pursuant to the\nprovisions of the Public Offering of Securities Act, with an issue value of BGN 0.50 (fifty stotinki) for each warrant,\nwhich entitle the warrant holders to exercise within a 10-year period their right to subscribe for the\ncorresponding number of shares (of the same type and class as the existing issue of shares of the company -\ndematerialized, registered, non-preferred, with the right to 1 (one) vote in the general meeting of the\nshareholders of the company, with the right to dividend and right to liquidation share) - the underlying asset of\nthe warrants under issue value BGN 2.00 (two Bulgarian lev) per share, at a warrant/share conversion ratio of\n1:1, which shares \"Eurohold Bulgaria\" AD will issue in the future conditional capital increase/s, under the\ncondition, that the new shares are issued only for subscription by the owners of the warrants.\nThe public offering of the issue of warrants of Eurohold Bulgaria AD shall be considered successfully\ncompleted only if at least 78 150 000 warrants are subscribed and fully paid, representing 30% (thirty percent) of\nthe offered for issuance securities. It is not possible to subscribe for warrants above the maximum permissible\namount of securities offered for issuance amounting to 260 500 000 warrants.\nTo carry out the public offering of the issue of warrants of Eurohold Bulgaria AD, the company will\npublish a prospectus in the manner and with the content provided for in the POSA and its implementing acts,\nafter such prospectus is confirmed by the Financial Supervision Commission. The planned use of the funds raised\n2through the issue of warrants and the risks related to the activity of Eurohold Bulgaria AD and to the investment\nin the securities subject to the public offering will be described in detail in the prospectus.\nThe investment intermediary, which will service the warrants issue of Eurohold Bulgaria AD under the\nconditions of public offering, will be Focal Point Investments AD, entered in the Commercial Register at the\nRegistry Agency with UIC: 121712048, with registered office and address in Sofia, 1303, Vazrazhdane District, 73\nTodor Aleksandrov Blvd.\nThe prospectus for public offering of the issue of warrants of Eurohold Bulgaria AD will be available to\npotential investors and the current shareholders of the company through its publication on the issuer's website -\nwww.eurohold.bg and the authorized investment intermediary Focal Point Investments AD, Sofia -\nwww.focalpoint.bg. Additional information on the prospectus, as well as a free copy of it will be available at the\nregistered address of the issuer Eurohold Bulgaria AD: Sofia 1592, 43 Christopher Columbus Blvd., Tel.: (+359 2)\n9651 563, Fax: {+359 2) 9651 652, contact person: Ga/ya Georgieva, from 9.30 am to 5.00 pm every working day\nduring the period of the public offering. In accordance with the regulatory requirements, the prospectus will be\npublished and available on the websites of the Financial Supervision Commission, www.fsc.bg and on the\nBulgarian Stock Exchange -Sofia AD - www.bse-sofia.bg, at the public registers where all the periodic and other\nregulated information about the issuer of the securities -Eurohold Bulgaria AD can be obtained.\nPursuant to Art. 112b, para. 2 in conj. with Art. 112b, para. 11 of the POSA, the persons who have\nacquired shares no later than 5 (five) working days after the date of publication of the announcement under Art.\n89t, para. 1 of POSA shall be entitled to participate in the procedure of the public offering of warrants. Within\ntwo working days of the expiration of the specified term of 5 working days, the Central Depository AD opens\naccounts for rights of these persons on the basis of data entered in the book of shareholders. Against each share\nfrom the capital of Eurohold Bulgaria AD is issued one right within the meaning of§ 1, item 3 of the Additional\nProvisions of the POSA in conj. with Art. 112b, para. 11 of POSA. Against each 1 (one) right, its holder may\nsubscribe for 1 (one) warrant from the issue of warrants at an issue value of BGN 0.50 (fifty stotinki) for a\nwarrant. All persons who wish to subscribe for warrants from the issue of warrants of Eurohold Bulgaria AD shall\nfirst acquire rights. The current shareholders acquire the rights free of charge under the procedure described\nabove. All other investors may purchase rights through a trade performed at the organized by the Bulgarian\nStock Exchange - Sofia AD ✓/Rights Market\" within the term for free trading of the rights or through purchase\nunder the conditions of an open auction for the unexercised rights, according to the procedure described in detail\nin prospectus.\nIn accordance with Art. 89/, para. 1 of the POSA, the General Meeting of Shareholders authorizes the\nManagement Board of Eurohold Bulgaria AD to decide on a one-time extension of the term for subscription of\nwarrants by up to 60 (sixty) days, as in which case, the relevant amendments will be made to the prospectus for\npublic offering and the issuer will immediately publish the information on the extension of the term on its\nwebsite, the Financial Supervision Commission and the authorized investment intermediary Euro-Finance AD will\nbe notified. In this case, the last day of the extended subscription period will be considered the subscription\ndeadline.\nAll other regulatory conditions and requirements in connection with the public offering of the issue of\nwarrants of Eurohold Bulgaria AD will be detailed and duly described in the prospectus for public offering of\nsecurities, the adoption of which by the Management Board of the company is forthcoming.\nIn accordance with the resolution for the issuance of the issue of warrants, the General Meeting of\nShareholders authorizes the Management Board of the company at its discretion, within the main parameters\napproved by the General Meeting of Shareholders and in accordance with the applicable law, to specify all other\nlegal and financial parameters of the issue of warrants and to determine all additional terms and conditions,\nlegal and financial parameters of the issue within the limits set by the resolution of the General Meeting and the\nlaw, as well as to perform all other legal and factual acts required by law in connection with the issuance of the\nissue of warrants, including the acts related to the subsequent preparation and approval by the Financial\nSupervision Commission of a prospectus for public offering of the issue of warrants.)\n3II. MATERIALS RELEVANT TO THE AGENDA OF THE MEETING OF THE SHAREHOLDERS\n1. Notice to shareholders for the extraordinary Meeting of the Shareholders of Eurohold Bulgaria AD;\n2. Sample of a power of attorney for participation at the Meeting of the Shareholders of Eurohold\nBulgaria AD;\n3. Minutes from a session of the Management Board of Eurohold Bulgaria AD convening the\nextraordinary Meeting of the Shareholders of Eurohold Bulgaria AD;\n\\\nEXECUt\n',,\nASEN MINCHEV\n4Sample\nP O W E R – O F – A T T O R N E Y *\nThe undersigned ……………………………………………….., citizen of …………………………………, PIN/ born on\n…………………………………., ID card/ passport № …………………………………, issued on ……………………….., valid till, permanent\nresidence: ……………………………………………., in my capacity of ……………………………………….\n(data of the represented natural/ legal person), possessing as of ………………… (day/month/year – the date pursuant to\nthe invitation to the shareholders)) ………………………………………. number (description of shares) voting shares from the\nshare capital of EUROHOLD BULGARIA AD, registered with the Trade Register at the Registry Agency, UIC 175187337,\nhaving its registered seat and address of management at 43 Christopher Columbus Blvd., Iskar district, city of Sofia,\npursuant to art. 226 of the Commerce Act (CA) and art. 116, paragraph 1 of Public Offering of Securities Act\n(POSA),hereby\nA U T H O R I Z E :\n……………………………………………………………….. (full name), PIN/ born on ……………………………, ID card/ passport №\n…………………………………, issued on ……………………….., valid till, address: …………………………………………….\nTO REPRESENT ……………………………………………………………….. at annual/ extraordinary session of the General meeting of\nshareholders of EUROHOLD BULGARIA AD, which will be held on ………………… (day, month, year) at ……………. am at\n43 Christopher Columbus Blvd., Iskar district, city of Sofia, conference hall and to vote with all shares owned by\n............................................ under the items of the agenda by the following way, namely:\nI. ANNOUNCED AGENDA OF THE SESSION OF THE GENERAL MEETING OF SHAREHOLDERS pursuant to the published\ninvitation to the shareholders and as the case may be, announced under the procedure of Art. 223 of the CA in\nrelation to Art. 115, par. 4 of the POSA or Art. 223a of the CA relating to Art. 115, par. 7 of the POSA\n…………………………………………………………………………………………………\nII. DRAFT RESOLUTIONS ON THE SEPARATE ITEMS FROM THE AGENDA OF THE SESSION OF THE GENERAL MEETING\nOF SHAREHOLDERS pursuant to the published invitation to the shareholders and as the case may be, announced\nunder the procedure of Art. 223 of the CA or Art. 223a of the CA.\n…………………………………………………………………………………………………\nIII. MANNER OF VOTING BY THE PROXY ON THE SEPARATE ITEMS OF THE AGENDA OF THE GENERAL MEETING OF\nSHAREHOLDERS:\nThe proxy shall be entitled to consider whether and how to vote at his own discretion, to decide whether to vote\nFOR, AGAINST or ABSTAIN FROM voting under any and all draft resolutions during the session of the General\nMeeting of shareholders of EUROHOLD BULGARIA AD.\nThe authorization includes the questions added into the agenda under the conditions of Art. 231, par. 1 of the CA\nand not announced or published in accordance with Art. 223 of the CA, as well as the manner of voting by the proxy\nin the cases under Art. 231, par. 1 of the CA.\nIn case that the manner of voting by the proxy is not specified under each item of the agenda, it shall be pointed out\nthat the proxy may vote at his/her own discretion (at his own discretion to vote “FOR”, “AGAINST” or\n“ABSTAINED”)under each draft resolutions during the session of the General meeting of the shareholders of\nEUROHOLD BULGARIA AD\nIt should be pointed out whether the authorization covers items which are included in the agenda under the\nconditions of Art. 231, paragraph 1 of the Commerce Act and are not notified to or announced pursuant to Art. 223 of\nthe CA, as well as with respect to the way of voting by the proxy in the cases of Art. 231, paragraph 1 of the CA.\nDate: …………………………………… FOR AND ON BEHALF OF: (……………………..)\n*This power- of- attorney should be with notarized signature."
}