[
    {
        "url": "https://www.gpw.pl/komunikat?geru_id=440609&title=Invitation+and+materials+for+a+General+shareholders+meeting",
        "summary": "Podsumowanie dokumentu finansowego dotyczącego zaproszenia i materiałów na Nadzwyczajne Walne Zgromadzenie Akcjonariuszy EUROHOLD BULGARIA AD:\n\n1. **Data i miejsce zgromadzenia**: Zgromadzenie zaplanowano na 30 maja 2024 roku.\n\n2. **Przedmiot zgromadzenia**: Głównym punktem agendy jest przyjęcie uchwały dotyczącej emisji gwarancji przez EUROHOLD BULGARIA AD. Planuje się wyemitować do 260 500 000 zdematerializowanych, zarejestrowanych, swobodnie zbywalnych gwarancji.\n\n3. **Warunki emisji gwarancji**:\n   - Każda gwarancja ma wartość emisyjną 0,50 BGN.\n   - Gwarancje uprawniają do subskrypcji akcji w przyszłych zwiększeniach kapitału warunkowego.\n   - Cena subskrypcji akcji wynosi 2,00 BGN za akcję.\n   - Stosunek konwersji gwarancja/akcja wynosi 1:1.\n\n4. **Warunki powodzenia oferty publicznej**:\n   - Oferta zostanie uznana za udaną, jeśli zostanie zasubskrybowane i w pełni opłacone co najmniej 78 150 000 gwarancji, co stanowi 30% oferowanych papierów wartościowych.\n\n5. **Prospekt emisyjny**:\n   - Firma opublikuje prospekt emisyjny zgodnie z ustawą o ofercie publicznej i jej aktami wykonawczymi po zatwierdzeniu przez Komisję Nadzoru Finansowego.\n   - Prospekt będzie dostępny na stronie internetowej emitenta oraz u pośrednika inwestycyjnego.\n\n6. **Pośrednik inwestycyjny**:\n   - Emisję gwarancji obsłuży Euro-Finance AD, zarejestrowany w Sofii.\n\n7. **Prawa uczestnictwa w ofercie**:\n   - Osoby, które nabyły akcje nie później niż 5 dni roboczych po dacie publikacji ogłoszenia, będą miały prawo uczestniczyć w ofercie publicznej gwarancji.\n\n8. **Zarząd**:\n   - Walne Zgromadzenie Akcjonariuszy upoważnia Zarząd do określenia wszystkich dodatkowych warunków prawnych i finansowych emisji gwarancji oraz do wykonania wszystkich czynności prawnych i faktycznych związanych z emisją.\n\n9. **Dodatkowe materiały**:\n   - Dołączono zawiadomienie dla akcjonariuszy, wzór pełnomocnictwa do udziału w zgromadzeniu oraz protokół z posiedzenia Zarządu dotyczącego zwołania zgromadzenia.\n\nDokument zawiera szczegółowe informacje dotyczące planowanej emisji gwarancji, warunków uczestnictwa w ofercie, a także procedur związanych z zarządzaniem i realizacją emisji."
    }
]